app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asasva"], ["body", "asvasvas"], ["created_at", "2020-06-18 14:14:53.475169"], ["updated_at", "2020-06-18 14:14:53.475169"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:success] = "Book was successfully created."
      redirect_to book_path(@book)
    else
      @books = Book.all